<a href="https://colab.research.google.com/github/MadhurimaPaul-87/Python-Data-Analysis-and-Visualization-Bootcamp/blob/main/Pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
#create a dataframe from clipboard cannot be done in colab(cloud)
data={'First name':['Tinu','Marek','Lily','Olatunkbo','Adrienne','Axelia','Jon-Kabat','Thabang','Kgaogelo'],'Last name':['Elejogun','Kostrzewski','McGarrett','Chijiaku','Anthoula','Athanasios','Zinn','Mosoa','Mosoa'],'Age':['14','25','18','22','22','22','22','15','11']}

In [3]:
age_df = pd.DataFrame.from_dict(data)
print(age_df)

  First name    Last name Age
0       Tinu     Elejogun  14
1      Marek  Kostrzewski  25
2       Lily    McGarrett  18
3  Olatunkbo     Chijiaku  22
4   Adrienne     Anthoula  22
5     Axelia   Athanasios  22
6  Jon-Kabat         Zinn  22
7    Thabang        Mosoa  15
8   Kgaogelo        Mosoa  11

In [4]:
#Display column names
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [5]:
#Access one or more columns
age_df['First name']

0         Tinu
1        Marek
2         Lily
3    Olatunkbo
4     Adrienne
5       Axelia
6    Jon-Kabat
7      Thabang
8     Kgaogelo
Name: First name, dtype: object

In [6]:
age_df[['First name','Age']]

  First name Age
0       Tinu  14
1      Marek  25
2       Lily  18
3  Olatunkbo  22
4   Adrienne  22
5     Axelia  22
6  Jon-Kabat  22
7    Thabang  15
8   Kgaogelo  11

In [7]:
#What in nan value
age_df['Rank']=np.nan
print(age_df)

  First name    Last name Age  Rank
0       Tinu     Elejogun  14   NaN
1      Marek  Kostrzewski  25   NaN
2       Lily    McGarrett  18   NaN
3  Olatunkbo     Chijiaku  22   NaN
4   Adrienne     Anthoula  22   NaN
5     Axelia   Athanasios  22   NaN
6  Jon-Kabat         Zinn  22   NaN
7    Thabang        Mosoa  15   NaN
8   Kgaogelo        Mosoa  11   NaN

In [8]:
#head() and tail() functions
age_df.head()

  First name    Last name Age  Rank
0       Tinu     Elejogun  14   NaN
1      Marek  Kostrzewski  25   NaN
2       Lily    McGarrett  18   NaN
3  Olatunkbo     Chijiaku  22   NaN
4   Adrienne     Anthoula  22   NaN

In [9]:
age_df.tail()

  First name   Last name Age  Rank
4   Adrienne    Anthoula  22   NaN
5     Axelia  Athanasios  22   NaN
6  Jon-Kabat        Zinn  22   NaN
7    Thabang       Mosoa  15   NaN
8   Kgaogelo       Mosoa  11   NaN

In [10]:
#Assigning value to dataframe

array_1=np.arange(9)
array_1

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [11]:
age_df['Rank']=array_1
print(age_df)

  First name    Last name Age  Rank
0       Tinu     Elejogun  14     0
1      Marek  Kostrzewski  25     1
2       Lily    McGarrett  18     2
3  Olatunkbo     Chijiaku  22     3
4   Adrienne     Anthoula  22     4
5     Axelia   Athanasios  22     5
6  Jon-Kabat         Zinn  22     6
7    Thabang        Mosoa  15     7
8   Kgaogelo        Mosoa  11     8

In [12]:
newrank_series= pd.Series([10,11,12],index=[3,5,6])
age_df['Rank']=newrank_series
age_df

  First name    Last name Age  Rank
0       Tinu     Elejogun  14   NaN
1      Marek  Kostrzewski  25   NaN
2       Lily    McGarrett  18   NaN
3  Olatunkbo     Chijiaku  22  10.0
4   Adrienne     Anthoula  22   NaN
5     Axelia   Athanasios  22  11.0
6  Jon-Kabat         Zinn  22  12.0
7    Thabang        Mosoa  15   NaN
8   Kgaogelo        Mosoa  11   NaN

In [13]:
del(age_df['Last name'])
print(age_df)

  First name Age  Rank
0       Tinu  14   NaN
1      Marek  25   NaN
2       Lily  18   NaN
3  Olatunkbo  22  10.0
4   Adrienne  22   NaN
5     Axelia  22  11.0
6  Jon-Kabat  22  12.0
7    Thabang  15   NaN
8   Kgaogelo  11   NaN